docs/reference/walkthrough-equation.org
#+title: Walkthrough: a command applied to an equation
#+HTML_HEAD: <link rel="stylesheet" href="style.css" />

A single =maf-defcmd= command traced end-to-end against a /relation/ (an
equation). The interesting part here is not encasing — it's that the body
runs *once per side* and the macro reassembles the two results into a new
relation. Seeing it concretely should anchor the per-side model.

For the higher-level overview, see [[file:concepts.org][concepts.org]]. For the encasing-heavy
sub-expression case, see [[file:walkthrough.org][walkthrough.org]].

* Starting state

Stack:
#+begin_example
1: x = 5
#+end_example

In calc terms the entry is the relation =(calcFunc-eq (var x var-x) 5)=.
Point is at the entry's line-prefix margin (not inside the formula text, not
at a sub-expression). No active calc selection.

* The declaration

The user writes a perfectly ordinary unary command — it knows nothing about
relations:

#+begin_src emacs-lisp
(maf-defcmd maf-square (expr arg commit)
  "Square command."
  :arity unary
  :prefix "sqr"
  (commit (calcFunc-mul expr expr)))
#+end_src

The body squares whatever =expr= it is handed and commits the result. That
the target happens to be an equation is invisible to it.

* Macro expansion

=maf-defcmd= is equation-aware: it expands to a =defun= that branches on the
resolved target. The non-equation path is the familiar single-pass flow; the
equation path runs the body twice.

#+begin_src emacs-lisp
(defun maf-square ()
  "Square command."
  (interactive)
  (let* ((context-1 (maf--resolve-context '((:arity . unary) (:prefix . "sqr"))))
         (arg (alist-get :arg context-1)))
    (if (eq (alist-get :target context-1) 'equation)
        ;; Equation: run the body once with expr bound to the LHS, once
        ;; bound to the RHS, capturing each committed value. arg is bound
        ;; once above, so both sides share it.
        (let (lhs-2 rhs-3)
          (let ((expr (alist-get :lhs context-1)))
            (cl-flet ((commit (val) (setq lhs-2 val)))
              (commit (calcFunc-mul expr expr))))
          (let ((expr (alist-get :rhs context-1)))
            (cl-flet ((commit (val) (setq rhs-3 val)))
              (commit (calcFunc-mul expr expr))))
          (maf--commit (list (alist-get :rel-op context-1) lhs-2 rhs-3)
                       context-1))
      ;; All other targets: body runs once with :expr.
      (let ((expr (alist-get :expr context-1)))
        (cl-flet ((commit (val) (maf--commit val context-1)))
          (commit (calcFunc-mul expr expr)))))))
#+end_src

The crucial trick: on the equation path, =commit= is rebound to a plain
=setq= into a per-side variable — it does *not* touch the calc stack. The
body calls =commit= believing it finalizes the result, but on each side it
just stashes the value. Only after both sides have run does the macro build
the new relation and call =maf--commit= once.

* Phase 1: resolve

=maf--resolve-context= is called with opts =((:arity . unary) (:prefix . "sqr"))=.

The cascade checks predicates in priority order:

1. =(maf--sel-any-p)= — active selection anywhere? No. Skip.
2. =(maf--at-home-p)= — point past the last entry? No. Skip.
3. =(maf--at-subexpr-p)= — point inside an entry's formula text? No, point is
   at the line-prefix margin. Skip.
4. =(maf--at-equation-p)= — is the entry under point a relation? Yes. Match —
   call =maf--resolve-target-equation=.

Note the priority: =subexpr= sits *above* =equation=. If point were on the
=5= inside the formula, the sub-expression target would win and only that
=5= would be squared. The equation target fires only when point is on the
entry as a whole (margin or EOL).

Inside =maf--resolve-target-equation=:

1. =m = (calc-locate-cursor-element (point))= = 1 (the relation is the top entry).
2. =expr = (calc-top 1 'full)= = =(calcFunc-eq (var x var-x) 5)=.
3. The =binary + m=1= guard does *not* fire (we're unary). For binary it
   would error here — see Variations.

The returned context alist:

#+begin_src emacs-lisp
((:target     . equation)
 (:expr       . (calcFunc-eq (var x var-x) 5)) ;; the whole relation
 (:rel-op     . calcFunc-eq)                   ;; the relation operator
 (:lhs        . (var x var-x))                 ;; normalized left side
 (:rhs        . 5)                             ;; normalized right side
 (:arg        . nil)                           ;; unary, no second operand
 (:m          . 1)                             ;; relation's stack position
 (:commit-m   . 1)                             ;; commit pushes at level 1
 (:commit-n   . 1)                             ;; pop 1 before pushing (replace)
 (:post-pop   . 0)                             ;; no arg to consume (unary)
 (:prefix     . "sqr")                         ;; merged from opts
 (:arity      . unary)
 (:keep       . nil))                          ;; calc-keep-args-flag snapshot
#+end_src

Three equation-only keys carry the relation apart so the macro can put it
back together:
- =:rel-op= — the operator symbol (=calcFunc-eq=, =calcFunc-neq=, =calcFunc-lt=, …)
- =:lhs= / =:rhs= — the two sides, each =math-normalize='d so the body sees
  clean values

There is *no* =:expr-ref= here. Unlike selection/subexpr, the equation
target doesn't splice into a parent formula — it rebuilds the whole entry —
so no encased eq-reference is needed.

* Phase 2: body (runs twice)

The macro binds =arg = nil= once, then runs the body once per side.

*LHS pass* — =expr = (var x var-x)=, =commit= rebound to =(setq lhs-2 ...)=:
#+begin_src emacs-lisp
(commit (calcFunc-mul expr expr))   ;; (calcFunc-mul (var x var-x) (var x var-x))
#+end_src
=lhs-2= ← =(calcFunc-mul (var x var-x) (var x var-x))= (calc normalizes this
to =x^2= on push).

*RHS pass* — =expr = 5=, =commit= rebound to =(setq rhs-3 ...)=:
#+begin_src emacs-lisp
(commit (calcFunc-mul expr expr))   ;; (calcFunc-mul 5 5)
#+end_src
=rhs-3= ← =(calcFunc-mul 5 5)= (normalizes to =25=).

The body is identical both times; only =expr= and the =commit= target
differ. The command author never wrote a loop — the macro provides it.

* Phase 3: commit

The macro reassembles a fresh relation and calls =maf--commit= once:

#+begin_src emacs-lisp
(maf--commit (list 'calcFunc-eq
                   '(calcFunc-mul (var x var-x) (var x var-x))
                   '(calcFunc-mul 5 5))
             context-1)
#+end_src

=maf--commit= destructures the context:
#+begin_example
target      = equation
prefix      = "sqr"
commit-m    = 1
commit-n    = 1
post-pop    = 0
#+end_example

The =equation= pcase branch is the simplest of all — =val= is already a
complete relation, so there is nothing to splice:

#+begin_src emacs-lisp
('equation (maf--commit-push commit-n prefix val commit-m nil post-pop))
#+end_src

=(maf--commit-push 1 "sqr" <relation> 1 nil 0)= pops the old relation at
level 1 and pushes the new one. Calc normalizes on push, so the displayed
stack reads:

#+begin_example
1: x^2 = 25
#+end_example

The trail records the operation under "sqr".

* The per-side dance, summarized

Three places cooperate, and the division of labor is the whole point:

1. **resolve** ([[file:../src/maf-resolve.el][maf-resolve.el]])
   - recognizes the entry is a relation and splits it into =:rel-op=, =:lhs=,
     =:rhs= (each normalized)
   - derives the same commit recipe (=:commit-m= / =:commit-n= / =:post-pop=)
     any whole-entry target would use
2. **macro** ([[file:../src/maf-defcmd.el][maf-defcmd.el]])
   - runs the body once per side, rebinding =commit= to a capture variable
     so the body's "commit" is intercepted rather than applied
   - reassembles =(rel-op lhs rhs)= and calls =maf--commit= a single time
3. **commit** ([[file:../src/maf-commit.el][maf-commit.el]])
   - treats the reassembled relation as an opaque whole-entry value and
     pushes it — no splice, no encasing

The body stays oblivious. A command written for scalars works on equations
for free, because the per-side iteration lives entirely in the scaffolding.

* Variations at a glance

- *Binary commands* — =:arg= is the top stack entry, *shared* across both
  sides and consumed once (=:post-pop= = 1). So multiplying =x = 5= by =2=
  gives =2 x = 10=, not =2 x = 5= or a double-consumed stack. Because the arg
  is the top, binary commands *require the relation to sit below the top*
  (=:m= > 1); resolve errors otherwise (see next).
- *Binary on the top relation* (=:m= = 1) — rejected. The arg would have to
  be the relation itself. Unlike the =entry= target, equation does *not*
  perform the ergonomic =m= 1→2 shift: the target must remain a relation, so
  resolve raises an error instead of silently retargeting.
- *Keep-args mode* — =:commit-m= = 1, =:commit-n= = 0, =:post-pop= = 0. The new
  relation lands on top, the original equation is left untouched below it.
- *Why no =:expr-ref= or encasing* — the equation target rebuilds the entire
  entry from =:rel-op= + two clean sides. There's no sub-formula to locate by
  =eq= inside a larger formula, so the encasing machinery from
  [[file:walkthrough.org][walkthrough.org]] never comes into play.
