docs/walkthrough-equation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-05-28 Thu 20:08 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Walkthrough: a command applied to an equation</title>
<meta name="author" content="David Yeung" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Walkthrough: a command applied to an equation</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org2ab4700">1. Starting state</a></li>
<li><a href="#org68487b5">2. The declaration</a></li>
<li><a href="#org1885dfa">3. Macro expansion</a></li>
<li><a href="#org6e6263e">4. Phase 1: resolve</a></li>
<li><a href="#org1d1bb88">5. Phase 2: body (runs twice)</a></li>
<li><a href="#org74ccdab">6. Phase 3: commit</a></li>
<li><a href="#orga12dc3c">7. The per-side dance, summarized</a></li>
<li><a href="#orgcba6e5a">8. Variations at a glance</a></li>
</ul>
</div>
</div>
<p>
A single <code>maf-defcmd</code> command traced end-to-end against a <i>relation</i> (an
equation). The interesting part here is not encasing — it's that the body
runs <b>once per side</b> and the macro reassembles the two results into a new
relation. Seeing it concretely should anchor the per-side model.
</p>

<p>
For the higher-level overview, see <a href="concepts.html">concepts.org</a>. For the encasing-heavy
sub-expression case, see <a href="walkthrough.html">walkthrough.org</a>.
</p>
<div id="outline-container-org2ab4700" class="outline-2">
<h2 id="org2ab4700"><span class="section-number-2">1.</span> Starting state</h2>
<div class="outline-text-2" id="text-1">
<p>
Stack:
</p>
<pre class="example" id="org1b786b2">
1: x = 5
</pre>

<p>
In calc terms the entry is the relation <code>(calcFunc-eq (var x var-x) 5)</code>.
Point is at the entry's line-prefix margin (not inside the formula text, not
at a sub-expression). No active calc selection.
</p>
</div>
</div>
<div id="outline-container-org68487b5" class="outline-2">
<h2 id="org68487b5"><span class="section-number-2">2.</span> The declaration</h2>
<div class="outline-text-2" id="text-2">
<p>
The user writes a perfectly ordinary unary command — it knows nothing about
relations:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(maf-defcmd maf-square (expr arg commit)
  "Square command."
  :arity unary
  :prefix "sqr"
  (commit (calcFunc-mul expr expr)))
</pre>
</div>

<p>
The body squares whatever <code>expr</code> it is handed and commits the result. That
the target happens to be an equation is invisible to it.
</p>
</div>
</div>
<div id="outline-container-org1885dfa" class="outline-2">
<h2 id="org1885dfa"><span class="section-number-2">3.</span> Macro expansion</h2>
<div class="outline-text-2" id="text-3">
<p>
<code>maf-defcmd</code> is equation-aware: it expands to a <code>defun</code> that branches on the
resolved target. The non-equation path is the familiar single-pass flow; the
equation path runs the body twice.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun maf-square ()
  "Square command."
  (interactive)
  (let* ((context-1 (maf--resolve-context '((:arity . unary) (:prefix . "sqr"))))
         (arg (alist-get :arg context-1)))
    (if (eq (alist-get :target context-1) 'equation)
        ;; Equation: run the body once with expr bound to the LHS, once
        ;; bound to the RHS, capturing each committed value. arg is bound
        ;; once above, so both sides share it.
        (let (lhs-2 rhs-3)
          (let ((expr (alist-get :lhs context-1)))
            (cl-flet ((commit (val) (setq lhs-2 val)))
              (commit (calcFunc-mul expr expr))))
          (let ((expr (alist-get :rhs context-1)))
            (cl-flet ((commit (val) (setq rhs-3 val)))
              (commit (calcFunc-mul expr expr))))
          (maf--commit (list (alist-get :rel-op context-1) lhs-2 rhs-3)
                       context-1))
      ;; All other targets: body runs once with :expr.
      (let ((expr (alist-get :expr context-1)))
        (cl-flet ((commit (val) (maf--commit val context-1)))
          (commit (calcFunc-mul expr expr)))))))
</pre>
</div>

<p>
The crucial trick: on the equation path, <code>commit</code> is rebound to a plain
<code>setq</code> into a per-side variable — it does <b>not</b> touch the calc stack. The
body calls <code>commit</code> believing it finalizes the result, but on each side it
just stashes the value. Only after both sides have run does the macro build
the new relation and call <code>maf--commit</code> once.
</p>
</div>
</div>
<div id="outline-container-org6e6263e" class="outline-2">
<h2 id="org6e6263e"><span class="section-number-2">4.</span> Phase 1: resolve</h2>
<div class="outline-text-2" id="text-4">
<p>
<code>maf--resolve-context</code> is called with opts <code>((:arity . unary) (:prefix . "sqr"))</code>.
</p>

<p>
The cascade checks predicates in priority order:
</p>

<ol class="org-ol">
<li><code>(maf--sel-any-p)</code> — active selection anywhere? No. Skip.</li>
<li><code>(maf--at-home-p)</code> — point past the last entry? No. Skip.</li>
<li><code>(maf--at-subexpr-p)</code> — point inside an entry's formula text? No, point is
at the line-prefix margin. Skip.</li>
<li><code>(maf--at-equation-p)</code> — is the entry under point a relation? Yes. Match —
call <code>maf--resolve-target-equation</code>.</li>
</ol>

<p>
Note the priority: <code>subexpr</code> sits <b>above</b> <code>equation</code>. If point were on the
<code>5</code> inside the formula, the sub-expression target would win and only that
<code>5</code> would be squared. The equation target fires only when point is on the
entry as a whole (margin or EOL).
</p>

<p>
Inside <code>maf--resolve-target-equation</code>:
</p>

<ol class="org-ol">
<li><code>m = (calc-locate-cursor-element (point))</code> = 1 (the relation is the top entry).</li>
<li><code>expr = (calc-top 1 'full)</code> = <code>(calcFunc-eq (var x var-x) 5)</code>.</li>
<li>The <code>binary + m=1</code> guard does <b>not</b> fire (we're unary). For binary it
would error here — see Variations.</li>
</ol>

<p>
The returned context alist:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">((:target     . equation)
 (:expr       . (calcFunc-eq (var x var-x) 5)) ;; the whole relation
 (:rel-op     . calcFunc-eq)                   ;; the relation operator
 (:lhs        . (var x var-x))                 ;; normalized left side
 (:rhs        . 5)                             ;; normalized right side
 (:arg        . nil)                           ;; unary, no second operand
 (:m          . 1)                             ;; relation's stack position
 (:commit-m   . 1)                             ;; commit pushes at level 1
 (:commit-n   . 1)                             ;; pop 1 before pushing (replace)
 (:post-pop   . 0)                             ;; no arg to consume (unary)
 (:prefix     . "sqr")                         ;; merged from opts
 (:arity      . unary)
 (:keep       . nil))                          ;; calc-keep-args-flag snapshot
</pre>
</div>

<p>
Three equation-only keys carry the relation apart so the macro can put it
back together:
</p>
<ul class="org-ul">
<li><code>:rel-op</code> — the operator symbol (<code>calcFunc-eq</code>, <code>calcFunc-neq</code>, <code>calcFunc-lt</code>, …)</li>
<li><code>:lhs</code> / <code>:rhs</code> — the two sides, each <code>math-normalize</code>'d so the body sees
clean values</li>
</ul>

<p>
There is <b>no</b> <code>:expr-ref</code> here. Unlike selection/subexpr, the equation
target doesn't splice into a parent formula — it rebuilds the whole entry —
so no encased eq-reference is needed.
</p>
</div>
</div>
<div id="outline-container-org1d1bb88" class="outline-2">
<h2 id="org1d1bb88"><span class="section-number-2">5.</span> Phase 2: body (runs twice)</h2>
<div class="outline-text-2" id="text-5">
<p>
The macro binds <code>arg = nil</code> once, then runs the body once per side.
</p>

<p>
<b>LHS pass</b> — <code>expr = (var x var-x)</code>, <code>commit</code> rebound to <code>(setq lhs-2 ...)</code>:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(commit (calcFunc-mul expr expr))   ;; (calcFunc-mul (var x var-x) (var x var-x))
</pre>
</div>
<p>
<code>lhs-2</code> ← <code>(calcFunc-mul (var x var-x) (var x var-x))</code> (calc normalizes this
to <code>x^2</code> on push).
</p>

<p>
<b>RHS pass</b> — <code>expr = 5</code>, <code>commit</code> rebound to <code>(setq rhs-3 ...)</code>:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(commit (calcFunc-mul expr expr))   ;; (calcFunc-mul 5 5)
</pre>
</div>
<p>
<code>rhs-3</code> ← <code>(calcFunc-mul 5 5)</code> (normalizes to <code>25</code>).
</p>

<p>
The body is identical both times; only <code>expr</code> and the <code>commit</code> target
differ. The command author never wrote a loop — the macro provides it.
</p>
</div>
</div>
<div id="outline-container-org74ccdab" class="outline-2">
<h2 id="org74ccdab"><span class="section-number-2">6.</span> Phase 3: commit</h2>
<div class="outline-text-2" id="text-6">
<p>
The macro reassembles a fresh relation and calls <code>maf--commit</code> once:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(maf--commit (list 'calcFunc-eq
                   '(calcFunc-mul (var x var-x) (var x var-x))
                   '(calcFunc-mul 5 5))
             context-1)
</pre>
</div>

<p>
<code>maf--commit</code> destructures the context:
</p>
<pre class="example" id="org6fc0e51">
target      = equation
prefix      = "sqr"
commit-m    = 1
commit-n    = 1
post-pop    = 0
</pre>

<p>
The <code>equation</code> pcase branch is the simplest of all — <code>val</code> is already a
complete relation, so there is nothing to splice:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">('equation (maf--commit-push commit-n prefix val commit-m nil post-pop))
</pre>
</div>

<p>
<code>(maf--commit-push 1 "sqr" &lt;relation&gt; 1 nil 0)</code> pops the old relation at
level 1 and pushes the new one. Calc normalizes on push, so the displayed
stack reads:
</p>

<pre class="example" id="orgb7d9baa">
1: x^2 = 25
</pre>

<p>
The trail records the operation under "sqr".
</p>
</div>
</div>
<div id="outline-container-orga12dc3c" class="outline-2">
<h2 id="orga12dc3c"><span class="section-number-2">7.</span> The per-side dance, summarized</h2>
<div class="outline-text-2" id="text-7">
<p>
Three places cooperate, and the division of labor is the whole point:
</p>

<ol class="org-ol">
<li><b><b>resolve</b></b> (<a href="../src/maf-resolve.el">maf-resolve.el</a>)
<ul class="org-ul">
<li>recognizes the entry is a relation and splits it into <code>:rel-op</code>, <code>:lhs</code>,
<code>:rhs</code> (each normalized)</li>
<li>derives the same commit recipe (<code>:commit-m</code> / <code>:commit-n</code> / <code>:post-pop</code>)
any whole-entry target would use</li>
</ul></li>
<li><b><b>macro</b></b> (<a href="../src/maf-defcmd.el">maf-defcmd.el</a>)
<ul class="org-ul">
<li>runs the body once per side, rebinding <code>commit</code> to a capture variable
so the body's "commit" is intercepted rather than applied</li>
<li>reassembles <code>(rel-op lhs rhs)</code> and calls <code>maf--commit</code> a single time</li>
</ul></li>
<li><b><b>commit</b></b> (<a href="../src/maf-commit.el">maf-commit.el</a>)
<ul class="org-ul">
<li>treats the reassembled relation as an opaque whole-entry value and
pushes it — no splice, no encasing</li>
</ul></li>
</ol>

<p>
The body stays oblivious. A command written for scalars works on equations
for free, because the per-side iteration lives entirely in the scaffolding.
</p>
</div>
</div>
<div id="outline-container-orgcba6e5a" class="outline-2">
<h2 id="orgcba6e5a"><span class="section-number-2">8.</span> Variations at a glance</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li><b>Binary commands</b> — <code>:arg</code> is the top stack entry, <b>shared</b> across both
sides and consumed once (<code>:post-pop</code> = 1). So multiplying <code>x = 5</code> by <code>2</code>
gives <code>2 x = 10</code>, not <code>2 x = 5</code> or a double-consumed stack. Because the arg
is the top, binary commands <b>require the relation to sit below the top</b>
(<code>:m</code> &gt; 1); resolve errors otherwise (see next).</li>
<li><b>Binary on the top relation</b> (<code>:m</code> = 1) — rejected. The arg would have to
be the relation itself. Unlike the <code>entry</code> target, equation does <b>not</b>
perform the ergonomic <code>m</code> 1→2 shift: the target must remain a relation, so
resolve raises an error instead of silently retargeting.</li>
<li><b>Keep-args mode</b> — <code>:commit-m</code> = 1, <code>:commit-n</code> = 0, <code>:post-pop</code> = 0. The new
relation lands on top, the original equation is left untouched below it.</li>
<li><b>Why no <code>:expr-ref</code> or encasing</b> — the equation target rebuilds the entire
entry from <code>:rel-op</code> + two clean sides. There's no sub-formula to locate by
<code>eq</code> inside a larger formula, so the encasing machinery from
<a href="walkthrough.html">walkthrough.org</a> never comes into play.</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: David Yeung</p>
<p class="date">Created: 2026-05-28 Thu 20:08</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
